import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '谦',
    id: 22,
    attr: {
        key: 'thunder',
        value: '雷'
    },
    job: '战士',
    transfer: ['战神', '饮命者'],
    camp: '旅人',
    avatar: '/assets/avatar/thunder/谦.png',
    card: [{
        type: '20攻击饮命者谦',
        src: '/assets/card/thunder/谦.jpg'
    },{
        type: '20血量战神谦',
        src: '/assets/card/thunder/谦z.jpg'
    },{
        type: '全属性8饮命者谦',
        src: '/assets/card/thunder/谦8.jpg'
    },{
        type: '全属性8战神谦',
        src: '/assets/card/thunder/谦8z.jpg'
    }],
    skill: [{
        skinName: '谦',
        leader: '战士队员的血量与攻击增加15%，晓和谦获得双倍效果,与御同时在场时，御的队长技同时生效',
        talent: '所有队员的暴击伤害增加20%，与晓同时在场时，自身受到的伤害减少15%，晓的伤害增加20%，否则自身暴击伤害增加80%',
        utl: '谦对敌方全体造成中量雷属性伤害',
        fate: '谦位于前排时，血量上限与防御增加30%，位于后排时，暴击率增加30%'
    }],
    resolves: [
        {
            auth: '流萤',
            date: '19年6月21日',
            paragraph: [
                '2019年2月，一对母子携手走进血族的世界，掀起一波腥风血雨，说到这里大家都知道是谁了 没错那就是御谦。',
                '首先说的是御，减少30％群体伤害的命运技，每回合回复己方7％血量的天赋，直接给大热的法师，黛丝等aoe平a的主流卡一记当头大棒，对对方群体附加防御，伤害降低debuff的同时具有不俗伤害的大招，再加上自身的水桶面板，让御可以配合包括暗队，月亮队，牧师队的大部分阵容。总之，只要你想针对对方的aoe伤害，或是拼队伍强度与持续作战能力，上御总不会错。',
                '接下来要说的就是谦了。谦虽是22c卡，但有着堪比26c卡的单体强度，且具备着独特的选择多样性，转职战神，饮命各有着截然不同但同样强力的作用。先分析下饮命谦：全体的20％爆伤buff，自身的高暴击率，暴击伤害，让谦成为战士队新的核心并配合miss的专属武器让战士队焕发了新生。在此之前，战士队虽平a伤害稳定，但因暴击率低下导致快速爆发不足的通病遭人诟病。如今，miss武器提高的暴击率，布洛尼亚提供的伤害buff，加上谦的爆伤加成，100级战士防具的血量加成（1件神使化身2％，积少成多），让战士队成为一个攻守皆备，既好用又好玩的队（本人做出了毕业战士队且亲测实战效果良好）。然后分析的是战神谦：相比于饮命谦，战神谦牺牲了一些搭配队伍的灵活性（需要与晓绑定，妹控实锤了233），换取而来的是自身的超高坦度及晓更高的输出，相信大家都有进攻御谦晓队伍时被晓越坦一刀一个小朋友的经历hhh',
                '最后说的就是御谦体系了，作为血族的第一组双队长技体系，御谦队伍不出意料地成为了版本的主流，能抗能打，御谦防守更是成为了鉴定进攻队伍强度的标准（通俗地说只要可以6成以上胜率击败高练度御谦队的队伍，就是强力进攻队）。御谦拥有着简单粗暴的战牧加属性队长技，适合搭配的自然是各种高强度战士牧师。',
                '推荐搭配：以战士和牧师为主，晓，奥西，夜萝，miss，神力灵儿，德莉莎等队员。'
            ]
        }
    ]
};

export default theData