import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '雷克斯',
    id: 38,
    attr: {
        key: 'thunder',
        value: '雷'
    },
    job: '法师',
        transfer: ['巫师', '术士'],
    camp: '异族',
    avatar: '/assets/avatar/thunder/雷克斯.png',
    card: [{
        type: '20攻击巫师雷克斯',
        src: '/assets/card/thunder/雷克斯.jpg'
    }],
    skill: [{
        skinName: '雷克斯',
        leader: '树与雷属性队员伤害增加40%，暴击时恢复15%生命',
        talent: '在白昼的星月幻想中，所有队员的必杀伤害增加15%，持续至战斗结束,友方的拉斯特攻击额外增加15%',
        utl: '雷克斯绘画出万千利剑，对敌方全体造成中量雷属性伤害',
        fate: '雷克斯进入战斗后绘制出假象恐吓敌人，使他们第一回合获得的怒气降低75%'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年7月29日',
            paragraph: [
                '大家好，我是刚出的时候又丑又弱除了真爱党根本没人用结果一加强就有很多人用了而且没德丽莎之前压怒全靠我的拉斯特唯一指定拐雷克斯。',
                '雷克斯最大的价值就是他的命运，天赋充其量只能说是个添头。他对怒气体系的克制幅度远大于德丽莎，并且在克制之余还能为己方的怒气体系提供一定的帮助，这就是雷克斯的独到之处了。',
                '现在的雷克斯是没有德丽莎的情况下的下位代替，或者是有时候不方便用德丽莎（被ban，光德仇恨太高怕坏事）也可以用雷克斯，而雷克斯的存在主要是为了打击怒气体系（法师，苟队，西利欧苏苏等非法牧的怒气卡，甚至有时候只是为了和奥里西斯一换一），而压怒最大的目的说到底还是为了给菜刀卡组对抗怒气卡组更多的回合数或者是给怒气卡组对决时拉开双方之间的怒气差距。不过雷克斯只能压一回合的怒，后续的还是得靠狐狸之类的卡。',
                '一句话概括——有这个命运在再弱也不会弱到哪去就是了。',
                '推荐搭配：哪里需要压怒哪里就有我'
            ]
        }
    ]
};

export default theData