import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '琪亚娜',
    id: 27,
    attr: {
        key: 'light',
        value: '光'
    },
    job: '射手',
    transfer: [ '游侠', '箭术长'],
    camp: '异世界',
    avatar: '/assets/avatar/light/琪亚娜.png',
    card: [{
        type: '20攻击游侠琪亚娜',
        src: '/assets/card/light/琪亚娜.jpg'
    }],
    skill: [{
        skinName: '琪亚娜',
        leader: '队伍中琪亚娜、八重樱、布洛妮娅、雷电芽衣、德丽莎攻击和血量增加20%',
        talent: '装备升级的速度变快,与八重樱、布洛妮娅、雷电芽衣、德丽莎中任意一人同时在场时，自身的攻击增加10%',
        utl: '琪亚娜对敌方全体造成中量光属性伤害',
        fate: '琪亚娜在场时，所有队员伤害增加10%'
    }],
    resolves: [
        {
            auth: '过过',
            date: '19年8月1日',
            paragraph: [
                '说起琪亚娜，她有3个优势',
                '第一。光属性第二个全体中量的aoe。以前的光aoe只有露露。苏苏和莉娅丝不是真正意义的aoe必杀。而且因为琪亚娜专武回怒的存在，琪亚娜也是比较容易开出大招的射手。',
                '第二。崩坏大队队长。我认为崩坏队就是一个一档队伍的标签，大部分比崩坏队强的都是t1队伍，没崩坏队强的基本都是t2的队伍（针对崩坏队如卡莉丝队长的构筑除外）',
                '第三。优质射手成员之一。',
                '但是这3个优势，大部分都是因为德丽莎的加入而凸显出来的，以前的琪亚娜的强不够明显。德丽莎加入后，让琪亚娜不仅可以活跃在崩坏队中，更是走出了崩坏队，进入了很多其他的队伍中作为“琪德组合”而存在。德丽莎控制怒气和暴击，琪亚娜靠德丽莎获取天赋10攻击，两个人共同buff全队6%血量同时琪亚娜buff全队10%增伤，可以说既可以作为aoe去使用琪亚娜，也可以让射手队携带琪亚娜这名强力的队员，以至于射手队抛弃了小樱组成出了“光暗射手队”并且用天狱法阵的这种新队伍构筑。',
                '可是从御开始，到烤鸭出现之后，大环境又重新偏向了法牧怒气体系了，崩坏队和射手队作为菜刀队地位自然下降。同时光属性aoe的质量和数量也进行了补足，原来的3个优势变得不那么突出，所以从节奏榜一档调整到了二档。',
                '推荐搭配：崩坏队，光暗射手队，卡莉丝队长下内战作为aoe使用，以及琪德组合外挂进任何需要光aoe的队伍中。'
            ]
        }
    ]
};

export default theData