import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '露露缇雅',
    id: 2,
    attr: {
        key: 'light',
        value: '光'
    },
    job: '法师',
    transfer: ['巫师', '术士'],
    camp: '法塔',
    avatar: '/assets/avatar/light/露露.png',
    card: [{
        type: '20攻击巫师露露',
        src: '/assets/card/light/露露.jpg'
    }],
    skill: '/assets/skill/light/露露.jpg',
    resolves: [
        {
            auth: '寒寒',
            date: '19年6月18号',
            paragraph: [
                '大家好，我是能制杖会持盾手持四十米大镰刀……的传奇法师露露缇雅。位列三幻神第二，法师队的万年核心。',
                '关于露露缇雅这张卡，其实能说的东西也不是特别多。露露缇雅强吗？强。为什么强？一是得益于唯一29c的地位面板巨高无比，二是拥有羡煞旁人的强力双专属，三是因为技能组简单粗暴加怒加伤加爆怒速一应俱全直接起飞，通常情况下是全游白字最高伤害aoe，四则是一个老生常谈的问题——光暗属性输出无死角。',
                '不过现在也早就过了露露缇雅一个人打一个队伍的时代了，更多的是露露缇雅与其他队员相辅相成、共同创造胜利的局面。其中优质的法师队友有微热巫女，艾斯卡，涅莉等人，而优质的回复牧师队友又有御，伊娜，维兰瑟，辉夜，月亮隐者等角色，这些卡的存在再加上德丽莎永夜莉萝这些出场率极高的坦克，基本上就构成了露露缇雅在血族手游中组建法师队的人员名单。',
                '应对不同的情况就需要选择不同的队友——输出多了坦克少了面对菜刀容易暴毙，坦克多了输出少了面对苟队容易打不死；怒气多了输出少了面对肉一点的一波容易打不死，输出多了怒气少了面对吃得下你平砍的又容易没开大就死了。我经常看到有人问“法师队怎么组”并且要求给出五张具体的卡，但是我也从来不会真的按他的要求给，因为法师队从来都不是一个一成不变的队伍。',
                '推荐搭配：推荐人选如上所说，根据实际情况挑选合适的队友。并且由于不同法阵造成的影响也不同，因此法师队最好还是看自己的手感'
            ]
        }
    ]
};

export default theData