import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '佑希',
    id: 14,
    attr: {
        key: 'dark',
        value: '暗'
    },
    job: '射手',
    transfer: ['游侠', '箭术长', '风吟者'],
    camp: '旅人',
    avatar: '/assets/avatar/dark/佑希.png',
    card: [{
        type: '20攻击风吟者佑希',
        src: '/assets/card/dark/佑希.jpg'
    }],
    skill: [{
        skinName: '锌镉熔融',
        leader: '暗属性与射手队员伤害增加35%（暗射手获得双倍效果）',
        talent: '后排射手队友暴击率增加20%，若转职为风吟者，则职业技能效果翻倍',
        utl: '佑希对敌方单体造成超大量暗属性伤害',
        fate: '佑希存活并且其他任意我方角色死亡时，我方所有存活角色伤害增加10%（效果可叠加）'
    }],
    resolves: [
        {
            auth: '流萤',
            date: '19年6月28日',
            paragraph: [
                '高暴击，高buff，高面板，射手队的核心，没错说的就是一个身为签到卡，没有三四星就不说了强度还堪比大师卡的佑希。',
                '说说佑希为什么强，天赋给予后排射手暴击率与独有的双倍风吟特效让佑希成为了一个发动机，并且自身在有着同样爆炸的输出同时，有不俗的硬度（做满防具+4后满血吃露露一个大或谦一个暴击不会死） 不同于一些有面板技能差 或者技能好面板差的卡，佑希优秀的面板和踏实的技能，让其可以适应大多菜刀队并且成为其中的核心发动机。',
                '推荐搭配：1，暗菜刀队，搭配夜凛，黛丝，巡林，熔融，奥西之类',
                '          2，射手队，搭配丽娅丝，巡林，06等',
                '          3，较为平民玩法，春日射，搭配春日，小樱，凛，巡林'
            ]
        }
    ]
};

export default theData