import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '夜之华殇·凛音',
    id: 5,
    attr: {
        key: 'dark',
        value: '暗'
    },
    job: '刺客',
    transfer: ['鬼剑', '影舞者'],
    camp: '异世界',
    avatar: '/assets/avatar/dark/夜凛.png',
    card: [{
        type: '20攻击鬼剑凛音',
        src: '/assets/card/water/凛音.jpg'
    }],
    skill: [{
        skinName: '夜之华殇·凛音',
        leader: '阵营为“异世界”的队员伤害增加50%，受到伤害减少10%',
        talent: '凛音免疫所有无法行动效果；此外，队伍中每拥有一名暗属性或刺客队员，所有队员攻击增加1%（效果可以叠加）',
        utl: '凛音对敌方单体造成大量伤害，并且使目标白骨1回合',
        fate: '我方存在任意暗属性或者水属性队友时，凛音暴击率增加30%，暴击伤害增加50%'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年6月19日',
            paragraph: [
                '大家好，我是从隔壁神无月过来的你们谁都别想控我抛弃了水属性变成纯暗的我已经无所畏惧了你知道我为什么作为一个刺客这么肉吗因为我在神无月里是个战士哈哈哈哈哈的高贵的魔族公主夜之华殇凛音简称夜凛。',
                '提到夜凛，众多菜刀不由得流下了眼泪。命运30暴击50爆伤，天赋全队加攻且无视包括麻痹石化束缚睡眠在内的任何控制，专属武器自带45％无视防御，属性又是无死角的暗，转个鬼剑神挡杀神佛挡杀佛，这谁顶得住啊？？？',
                '唉，我真傻，真的。我光知道夜凛天赋只有自己一个暗刺甚至带着德丽莎夜萝这种连5攻击都超不过，纯暗里带着锌镉熔融也就是全队6攻击，刺客队加个鲜血也就是全队7攻击，暗和刺的适应面只看数据是肯定比不上全队女/树6攻击女树12攻击的凛天赋的，却忘了夜凛和凛在实力上的差距，也忘了暗和树在实力上的差距。低面板给高加成也不过是中和一下而已，高面板给低加成本身起点就比前者要高很多了——举个例子，30x1.5和50x1.3能一样？',
                '推荐搭配：任何拥有水暗队友的菜刀队'
            ]
        }
    ]
};

export default theData