import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '奥里西斯',
    id: 1,
    attr: {
        key: 'dark',
        value: '暗'
    },
    job: '牧师',
    transfer: ['秘牧', '武姬', '执政官'],
    camp: '旅人',
    avatar: '/assets/avatar/dark/奥.png',
    card: [{
        type: '20攻击秘牧奥里西斯',
        src: '/assets/card/dark/奥.jpg'
    }, {
        type: '20攻击舞姬奥里西斯',
        src: '/assets/card/dark/奥w.jpg'
    }],
    skill: '/assets/skill/dark/奥.png',
    resolves: [
        {
            auth: '寒寒',
            date: '19年6月16号',
            paragraph: [
                '大家好，我是冥王兼天空龙奥西里斯（啊不对划掉）血族三幻神中的最强者奥里西斯。',
                '26c赋予了她强大的面板与身躯，暗属性赋予了她极强的攻击性与适用性，秘牧职业赋予了她至高无上的身份与地位。在全队毕业的情况下位列全血族防守阵容出场占比率第一，出场率甚至高于之前的版本号称“防守你没我就不行”的德丽莎。作为一张攻守兼备并且将速攻战与拉锯战完美结合到一起的卡，她的实力所有人有目共睹。',
                '抛开不常用的队长技不谈，奥里西斯的其他三个技能都有着几个需要注意的地方。必杀由于是aoe所以会配合天赋给所有非牧师敌人挂上一层重伤，配合奥里西斯命运的极速加怒，构成了令人闻风丧胆的奥速攻体系；天赋可叠加二层重伤（75％减疗，20％易伤），并且减疗效果是针对所有回血生效的——与死神这种光扣回复值却碰不了百分比回复和吸血的卡相比真的是天差地别。也正因为这个天赋，即使是擅长拖十回合的达莉娅队也无法在拥有四个不拖后腿的队友的奥里西斯面前撑得下这狂风暴雨般的攻击。',
                '而奥里西斯的命运正是补足她强度的最后一环——进入战斗满怒加伤的效果极少出现暂且不提，不满怒则获得100怒气（实际上是等到她行动才加的怒气，因此防守方开场满怒的奥不会被进攻方的月亮控住）的效果实在是太强了。虽然有着拿了怒气就伤害减半一回合的副作用，但是要么开场给敌方全体挂重伤要么等到第一回合副作用过后再以明显快于绝大多数aoe大招的速度甩下一大片伤害，无论哪个都不是正常情况下轻易吃得起的——因此对阵奥里西斯最好的方法就是让她在战斗结束之前开不出大招。',
                '推荐搭配：在跨服竞技场挂着鱼人队长露露队长都能打出全队最高伤害并且带飞全队取得胜利的卡，我真不知道有什么好写的……谁用谁知道，上就完事了'
            ]
        }
    ]
};

export default theData