import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '暗影巡林',
    id: 1,
    attr: {
        key: 'dark',
        value: '暗'
    },
    job: '射手',
    transfer: ['箭术长', '游侠', '风吟者'],
    camp: '异族',
    avatar: '/assets/avatar/dark/巡.png',
    card: [{
        type: '20攻击游侠暗影巡林',
        src: '/assets/card/dark/巡.jpg'
    }, {
        type: '20攻击风吟者暗影巡林',
        src: '/assets/card/dark/巡f.jpg'
    }],
    skill: [{
        skinName: '',
        leader: '所有队员攻击时无视敌方40%防御，受到伤害减少10%',
        talent: '暗影巡林优先攻击最虚弱的对手，每击杀1名敌人可获得30点怒气,友方水之式的血量与攻击增加10%',
        utl: '暗影巡林向天空射出暗影能量箭矢，对敌方全体造成中量伤害',
        fate: '后排的暗属性队友造成伤害的10%治疗自己,后排的射手队友与巡林，武器中“伤害随距离增加”的效果提升100%（技能实测效果：为射手武器额外添加一次90阶武器的距离判定，100级武器不会翻倍，1级角色也不会削弱）'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年6月17号',
            paragraph: [
                '大家好，我是能二号位能三号位能五号位甚至位置不够还可以去四号位简单说就是除了一号位其他位置都能站的血族三幻神最弱存在暗影巡林。',
                '三幻神中，露露缇雅29c不算鱼人战力血族第一面板高到离谱，奥里西斯26c唯二秘牧面板不低实力强劲，那么问题来了，暗影巡林这种22c面板差劲又没专属甚至命运还被砍了一刀的辣鸡卡是怎么成为三幻神之一的呢？',
                '答案有很多个，说是因为暗属性也没错，说是因为射手职业也靠谱，说是因为命运的buff也没差，但是最重要的原因还是因为她的天赋。',
                '这个“攻击目标锁定为敌方血量百分比最低角色”的效果，不知道让多少血族玩家又爱又恨。也正是因为这个天赋，巡林衍生出了三种流派的玩法。',
                '可能有很多人知道，巡林一开始是靠二号位点杀出名的（偶尔三号位），而即使到了现在点杀流巡林也依然没有完全退出历史舞台。黛丝挥锤艾萨尔拉弓，泷尉鸦啄奥镰起舞，吉哈小弑致命狙击，这些都是可以和巡林配合打出亮眼表现的例子。但是随着面板的堆砌，巡林的单人输出能力越来越有限，虽然在佑希等人的辅佐下依然能对后排造成巨大的点杀威胁，但终究是不如以前风光了。',
                '随着射手队的正式形成，血族也出现了一种新的流派——补刀流巡林。转职游侠风吟皆可，射手队五号位提供命运buff以及补刀残血，但是因为没有在后排吃各种射手buff，实际上也就是个半辅助半输出的打法而已，并且在巡林可以同时玩转三大玩法的情况下不顾其他两种贸然转职风吟，很是吃亏。',
                '第三种流派是最简单粗暴的流派，实际上也是在刚推出巡林的时候就已经出现了的，只不过因为收益没有点杀流高才渐渐没落，直到某些强力菜刀出现后才重新崛起——说到这可能已经有人猜到了，这种流派正是爆破流。依靠一号位与二号位的超强爆发将敌方人员打残，再由三号位的巡林进行精准打击，这就是这个流派的核心所在。在这里巡林就是一个几乎百分百不散打的输出，绝大多数情况下队友打谁我就打谁，相比起靠黛丝和第一回合不一定能开大的奥来导航的点杀流以及虽然有前几个队友的强劲输出但是自己在五号位并没有多高输出的补刀流来说，巡林的输出更稳定，收割几率也更高，比较常见于暗刀这种打法中，不过射手队三号位巡林也不少见。',
                '推荐搭配：其实都写在上面了，只能说巡林的用法真的很多而且每种都有各自的特点。很多人只会无脑用射手五号位巡林或巡黛二号位巡林，甚至还有很多人都还不知道站位这东西对血族pvp有多么大的影响。巡林也算是最为代表血族站位学的一张卡了，玩好巡林基本上就证明你学会了站位。'
            ]
        }
    ]
};

export default theData