import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '死翼千歌',
    id: 54,
    attr: {
        key: 'dark',
        value: '暗'
    },
    job: '法师',
    transfer: ['巫师', '贤者'],
    camp: '法塔',
    avatar: '/assets/avatar/dark/死翼千歌.png',
    card: [{
        type: '20攻击贤者死翼千歌',
        src: '/assets/card/dark/死翼千歌.jpg'
    }],
    skill: [{
        skinName: '死翼千歌',
        leader: '队员伤害的25%治疗自己，死翼千歌始终维持骨妖形态',
        talent: '与露露缇雅同时登场时双方血量上限增加10%；若释放必杀或回合开始若自身血量低于40%，则自身变身成为骨妖形态（攻击、防御增加40%），持续到战斗结束。',
        utl: '死翼千歌对敌方单体造成超大量暗属性伤害,若回合开始自己血量大于40%，额外为自己回复25%生命',
        fate: '奏歌·终焉（必杀技）的伤害增加20%，队友受到非法师敌人的伤害降低5%'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年7月29日',
            paragraph: [
                '大家好，我是看似娇小少女实则巨大骨妖号称死灵学派最后荣光不朽四页永不凋亡并且是露露几百年好姬友的歌者死翼千歌。',
                '小死自出道以来一直都是以一个能提供一定辅助能力的高强度单兵自居的，一开始是法师队用，然后出了法塔队法师不用她法塔用她，再后来法塔没落了小死也就跟着没落了，现在靠着两次加强以及版本趋势又找回了自己的场子。',
                '下面吐个槽。',
                '虚假的小死：血少才能变身，回血就会解除，骨妖状态存在感极其低下',
                '真正的小死：开大之前也能变身，血回上去也不会解除，高速唱大变身加40攻防面板爆炸疯狂输出屹立不倒',
                '目前版本小死主要用于法师队（准确说是多贤者队），凭借北京烤鸭卡莉丝涅莉这种有能力让贤者开大轮番轰炸的队长组建贤者队，再靠多贤者队疯狂的怒气获取与爆炸的大招伤害来灭杀敌人。',
                '推荐搭配：北京烤鸭，卡莉丝，涅莉，露露缇雅，萝丝蕾雅，鲷鱼烧，微热巫女等'
            ]
        }
    ]
};

export default theData