import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '西利欧',
    id: 53,
    attr: {
        key: 'dark',
        value: '暗'
    },
    job: '战士',
    transfer: ['战神', '饮命者'],
    camp: '异族',
    avatar: '/assets/avatar/dark/西利欧.png',
    card: [{
        type: '20血量战神西利欧',
        src: '/assets/card/dark/西利欧.jpg'
    }],
    skill: [{
        skinName: '佑希',
        leader: '暗属性与火属性队员攻击增加15%，受到伤害降低20%',
        talent: '西利欧进入战斗、每次受到伤害或治疗技能时获得15点怒气,与莉萝艾或拉斯特同队时，自身血量上限加15%（该效果可叠加）',
        utl: '西利欧嘲讽所有敌人，替队友吸引下次攻击，且受到的伤害降低60%',
        fate: '西利欧在战斗中首次使用渎神之铠时可以凝聚血液，为自己回复35%生命'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年8月1日',
            paragraph: [
                '大家好，我是在达莉娅出来之前最有可能达成0输出存活胜利并且开大前后完全是两个人又怕菜刀又克菜刀的前大暗铁壁西利欧。',
                '西利欧这张卡，想用得好必须得满足两个条件：1.对面没有阻止西利欧开大的能力；2.对面没有在西利欧开大后强杀西利欧及其队友的能力。',
                '因此，如果是面对法师队，西利欧需要搭配像御这种对法师有一定抵抗力的辅助或是与德丽莎构成双t（常见于达莉娅队）；如果是面对菜刀队，一是要保证不被秒（还是推荐搭配德丽莎，也可以与夜萝锌镉熔融眸夜祭歌组成多t速奶暗火防守体系），二是要保证开大后也能撑住菜刀——其中最有威胁的是奥里西斯（的重伤），其次是夜凛kk格洛丽娅三茶之类的的高爆发与毒。此时，西利欧有一个矛盾发生点：如果无间隔连续开大，有可能出现吃不住太高爆发暴毙；如果有出现开大空档而其他战神队友拉不住仇恨或扛不住伤害，就也有可能出现瞬间暴毙进而团灭的情况。',
                '当然，以上情况比较倾向于纯苟西利欧，如果是正常向的话基本上就是保证能开出第一个大招即可，因此只需要比较警惕德丽莎雷克斯月亮涅莉之类的压怒或控制卡和各种高爆发菜刀就行，比较常见的用法是眸夜祭歌队长带西利欧。',
                '总的来说，现在的西利欧算是一张使用难度颇高的卡，使用时需要对我方肉度和敌方输出有比较清晰的认知。',
                '推荐搭配：多见于达莉娅队长，眸夜祭歌队长，月亮队长与西利欧队长，一般不用作单t使用，经常与夜萝锌镉熔融眸夜祭歌德丽莎搭配。可搭配各种苟卡组成纯苟，也可搭配夜凛奥里西斯等强力输出予以反击。'
            ]
        }
    ]
};

export default theData