import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '晓',
    id: 35,
    attr: {
        key: 'tree',
        value: '木'
    },
    job: '战士',
    transfer: ['战神', '饮命者'],
    camp: '旅人',
    avatar: '/assets/avatar/tree/晓.png',
    card: [{
        type: '20攻击饮命者晓',
        src: '/assets/card/tree/晓.jpg'
    },{
        type: '全属性8饮命者晓',
        src: '/assets/card/tree/晓8.jpg'
    },{
        type: '20血量饮命者晓',
        src: '/assets/card/tree/晓x.jpg'
    },{
        type: '20血量战神晓',
        src: '/assets/card/tree/晓z.jpg'
    },{
        type: '全属性8战神晓',
        src: '/assets/card/tree/晓z8.jpg'
    },],
    skill: [{
        skinName: '晓',
        leader: '树属性队员造成的伤害增加50%，第一次暴击获得20怒气',
        talent: '晓掌握奥义：修罗之怒，普攻的暴击伤害增加100%',
        utl: '使用剑术：剑刃风暴，利用强大的剑气对敌方全体造成中量树属性伤害',
        fate: '晓位于前排时，血量上限与防御增加30%,位于后排时暴击概率增加30%'
    },{
        skinName: '皮肤·晓',
        leader: '树属性队员造成的伤害增加50%，第一次暴击获得20怒气',
        talent: '晓掌握奥义：修罗之怒，普攻的暴击伤害增加100%',
        utl: '使用剑术：剑刃风暴，利用强大的剑气对敌方单体造成超大量树属性伤害',
        fate: '晓位于前排时，血量上限与防御增加30%,位于后排时暴击概率增加30%'
    }],
    resolves: [
        {
            auth: '北斗',
            date: '19年7月8号',
            paragraph: [
                '晓是一张高输出的树卡。',
                '在升100武器后，其高暴击，高爆伤的优点进一步得以彰显，100%的爆伤，50%的暴击率让刺客都眼红，只是现在的定位有所变动，原先是菜刀树木力卡，菜刀木在目前环境中，也不是不厉害，纯色队里木队可能只弱于暗队和火队，只是木队被强的火卡压制太厉害。',
                '2019年初，随着御，谦的兴起，在欧尼酱，后妈的扶持下，晓再度重出江湖，作为“小于谦”队中的主力输出，在哥哥的带领下，晓的输出更加暴力，队长技带来30%的攻击提高，命运技带来20%的伤害提升，并且有着无视德理莎命运的特点，比刺客更胜一筹，对于目前流行的基佬坦，德理莎坦都能造成很大的伤害，并且30%的生命值提升也能让晓的生存力大大提升，有御的命运也不怕aoe，有旅人阵的话能更加保证晓的暴击输出，要说缺点么就是砍在萝莉身上还是输出不够，以及离开哥哥依然是妹妹一个。',
                '晓放前排做坦血量防御也很足，但是那样就失去意义，有太多的坦可以替代前排晓。',
                '适合队伍：小于谦，菜刀木（做好被火卡教育准备）'
            ]
        }
    ]
};

export default theData