import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '泷尉',
    id: 19,
    attr: {
        key: 'tree',
        value: '木'
    },
    job: '法师',
    transfer: ['巫师', '术士'],
    camp: '法塔',
    avatar: '/assets/avatar/tree/泷尉.png',
    card: [{
        type: '20攻击巫师泷尉',
        src: '/assets/card/tree/泷尉.jpg'
    }],
    skill: [{
        skinName: '泷尉',
        leader: '所有队员受到伤害降低25%，泷尉每回合获得10点怒气',
        talent: '泷尉指引“班长”与“噗叽”优先攻击克制属性的敌对玩家角色，且乌鸦的啄击有30%概率使敌人中毒',
        utl: '泷尉释放虚像：王庭裁决，召唤黑色的鸦群对敌方全体造成中量树属性伤害',
        fate: '泷尉指引“班长”与“噗叽”进行亡语啄击，攻击后使一名敌人损失少量怒气，并为泷尉恢复8%生命'
    }],
    resolves: [
        {
            auth: '北斗',
            date: '19年6月21日',
            paragraph: [
                '老牌防守队长。',
                '拥有高减伤的队长技，带三个特效（减怒，几率中毒，回血 ），在面对法师队前有不少的抗性，面对射手队等高配菜刀队前抵抗力较差，导向性攻击能够很好地对抗永罪，雷克斯，或者血少的雷系卡，攻击减怒能有效打乱对方节奏，放5号位能够克制对面西利欧使其开不出大（月亮队长的话还是能开出大的），队友建议选择战神和牧师，法师，进攻偶尔可以塞入法师队，或者给巡林作导向优先点杀雷卡。',
                '注意辣条虽然克制雷卡，但是对于基佬这种血多防高的，只是饶痒痒，甚至被反向克制，因为有基佬在他就不会点其他雷卡了。',
                '适合搭配队友：德丽莎，青龙，夜萝，露露。适合搭配的队伍：以辣条为队长的防守队伍，面对菜刀需双坦。'
            ]
        }
    ]
};

export default theData