import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '可可',
    id: 49,
    attr: {
        key: 'water',
        value: '水'
    },
    job: '法师',
    transfer: ['贤者', '巫师'],
    camp: '异族',
    avatar: '/assets/avatar/water/可可.png',
    card: [{
        type: '20攻击贤者可可',
        src: '/assets/card/water/可可.jpg'
    }],
    skill: [{
        skinName: '可可',
        leader: '水属性队员伤害增加35%，暴击率增加15%',
        talent: '水属性和法师队员暴击率增加5%（可叠加）,队伍中每拥有一名水属性队员，自身的暴击率（3%）和暴击伤害（5%）增加',
        utl: '可可对敌方单体造成超大量水属性伤害',
        fate: '战场上存在5名及以上水属性角色时，战场上水属性角色的伤害和暴击伤害增加15%'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年7月29日',
            paragraph: [
                '大家好，我是看似贤者法师实则鬼剑刺客法师队绝对不会有我位置只有在菜刀水里当一下唯一指定强力团队buff提供者才能找到存在感的可可。',
                '可可的技能组非常简单粗暴，属于正常人一看就知道是玩菜刀水用的卡的水平。并且在可可出来之前，菜刀水几乎没有任何团队buff（来人给我把丢人冷砂拖出去砍了），可可的到来算是正式晚各自为战的菜刀水提供了一个核心——不是输出核心，而是指提供团队buff的核心。并且，由于许多强力水刀并不是刺客职业，可可队长的到来也宣布着凌绮这个水刺队长的正式下岗。',
                '需要注意的是可可的命运是有可能被对面反蹭加成的，比如对着水树上可可就很容易被白嫖可可命运。',
                '当前版本算是可可与卡莉丝轮流当水刀队长，该莽就可可队长上去砍，该怂点就卡莉丝队长上去磨，也不至于像以前一样只能纯刀一条路走到黑了。',
                '推荐搭配：卡莉丝，吉哈雅缇，凌绮，凛音（非夜凛），苍岚，汐，还有狩仇恨冷砂雪奈之类的可以替补一下，总之可可只能搭配水也只能搭配水刀就是了。'
            ]
        }
    ]
};

export default theData