import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '可莉洛',
    id: 88,
    attr: {
        key: 'water',
        value: '水'
    },
    job: '刺客',
    transfer: ['鬼剑', '影舞者'],
    camp: '旅人',
    avatar: '/assets/avatar/water/可莉洛.png',
    card: [{
        type: '20攻击鬼剑可莉洛',
        src: '/assets/card/water/可莉洛.jpg'
    }],
    skill: [{
        skinName: '可莉洛',
        leader: '前排战士队员受到伤害降低30%,刺客队员伤害增加30%',
        talent: '可莉珞初始获得40级的装备与防具,凝冰异能使水属性与刺客队员每回合获得4点怒气（水属性刺客获得双倍效果）',
        utl: '可莉珞将空气中的水份凝结为冰锥，对敌方全体造成中量水属性伤害',
        fate: '制作黑暗料理，自身回复降低10%伤害增加10%,并诱使敌方的一名成员享用，使其伤害降低10%回复增加10%。'
    }, {
        skinName: '可莉洛·强化',
        leader: '前排战士队员受到伤害降低30%,刺客队员伤害增加30%',
        talent: '可莉珞初始获得40级的装备与防具,凝冰异能使水属性与刺客队员每回合获得4点怒气（水属性刺客获得双倍效果）',
        utl: '可莉珞将空气中的水份凝结为冰锥，对敌方全体造成中量水属性伤害',
        fate: '（好感度达到7级后强化）制作黑暗料理，自己降低10%回复提升10%攻击，敌方随机一人降低10%攻击提升10%回复。'
    }, {
        skinName: '炎夏·可莉洛',
        leader: '前排战士队员受到伤害降低30%,刺客队员伤害增加30%',
        talent: '可莉珞初始获得40级的装备与防具,凝冰异能使水属性与刺客队员每回合获得4点怒气（水属性刺客获得双倍效果）',
        utl: '可莉珞对敌方全体造成中量水属性伤害，并附带暴击率增加20%效果',
        fate: '制作黑暗料理，自身回复降低10%伤害增加10%,并诱使敌方的一名成员享用，使其伤害降低10%回复增加10%。'
    }, {
        skinName: '炎夏·可莉洛·强化',
        leader: '前排战士队员受到伤害降低30%,刺客队员伤害增加30%',
        talent: '可莉珞初始获得40级的装备与防具,凝冰异能使水属性与刺客队员每回合获得4点怒气（水属性刺客获得双倍效果）',
        utl: '可莉珞对敌方全体造成中量水属性伤害，并附带暴击率增加20%效果',
        fate: '（好感度达到7级后强化）制作黑暗料理，自己降低10%回复提升10%攻击，敌方随机一人降低10%攻击提升10%回复。'
    }, ],
    resolves: [
        {
            auth: '',
            date: '',
            paragraph: [
                ''
            ]
        }
    ]
};

export default theData