import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '吉哈雅缇',
    id: 40,
    attr: {
        key: 'water',
        value: '水'
    },
    job: '射手',
    transfer: ['游侠', '箭术长'],
    camp: '异族',
    avatar: '/assets/avatar/water/吉哈雅缇.png',
    card: [{
        type: '20攻击游侠吉哈雅缇',
        src: '/assets/card/water/吉哈雅缇.jpg'
    }],
    skill: [{
        skinName: '吉哈雅缇',
        leader: '阵营为“异族”的队员伤害增加50%，造成伤害的10%转化为生命',
        talent: '优先攻击克制属性的敌人，位于后排时伤害增加20%',
        utl: '吉哈雅缇对敌方单体造成超大量水属性伤害',
        fate: '战斗开始时获得50点怒气，满怒时普通攻击获得40%吸血效果（每3回合生效1次），必杀获得40%吸血效果'
    }],
    resolves: [
        {
            auth: '北斗',
            date: '19年7月31日',
            paragraph: [
                '吉哈雅缇是一张可玩性很高的卡。',
                '其特点是指向性攻击，能够指定攻击对方火卡，攻击力不低，并且有增伤20%，输出不俗，命运技开局加50怒气因此而开大很快，大招40%吸血又能恢复不少生命得以续航，面板属性也算不错，战力为射手中第三名（第一第二依次为伊莱雯和丽娅丝）。',
                '围绕着吉哈雅提的打法有很多，其中比较有效的一个是吉哈自己作为队长的异族队，这个队伍最好要有断罪法阵，这样就有总共15%的吸血，意味着打出10000的伤害就能回1500的血，2万就能回3千，这个数值虽然看上去不高，但是在没有牧师的情况下能回血也是相当不错的。',
                '异族队一般组水木异族队员，常见的成员有三茶，脚疼，凛，狐狸，巡林等，根据不同对手变换不同阵容，有天空龙可以上雷克斯或者德理莎，输出，续航，限制能力皆属上位，打于谦队也战绩不错。',
                '其次放在射手队中吉哈也能发挥点功效，对付于谦队可以点杀御。',
                '壕水队吉哈也是必不可少，目前吉哈的输出能力已经超出了仇恨女士。水木队可以德拉贡队长，点射火系卡。',
                '适合队伍：异族队，射手队，水队，水木队。'
            ]
        }
    ]
};

export default theData