import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '绫叁',
    id: 82,
    attr: {
        key: 'water',
        value: '水'
    },
    job: '战士',
    transfer: ['战神', '饮命者'],
    camp: '圣地',
    avatar: '/assets/avatar/water/绫叁.png',
    card: [{
        type: '20血量战神绫叁',
        src: '/assets/card/water/绫叁.jpg'
    },{
        type: '20攻击战神绫叁',
        src: '/assets/card/water/绫叁gz.jpg'
    },{
        type: '全属性8战神绫叁',
        src: '/assets/card/water/绫叁8.jpg'
    },{
        type: '20攻击饮命者绫叁',
        src: '/assets/card/water/绫叁y.jpg'
    },],
    skill: [{
        skinName: '绫叁',
        leader: '水属性队员造成的伤害增加50%，血量上限增加10%',
        talent: '绫叁为猎杀百名异端钻研暗系弱点，可对暗系敌人追加50%伤害',
        utl: '绫叁释放出多重能量，对敌方单体造成超大量水属性伤害，并使其回复降低50%，持续2回合',
        fate: '绫叁每次受到攻击或治疗技能时获得10点怒气，且必杀伤害提升10%，持续3回合'
    }, {
        skinName: '战争领域·绫叁',
        leader: '水属性队员造成的伤害增加50%，血量上限增加10%',
        talent: '绫叁为猎杀百名异端钻研暗系弱点，可对暗系敌人追加50%伤害',
        utl: '绫叁释放出多重能量，对敌方单体造成超大量水属性伤害（伤害额外增加20%）',
        fate: '绫叁每次受到攻击或治疗技能时获得10点怒气，且必杀伤害提升10%，持续3回合'
    }],
    resolves: [
        {
            auth: '寒寒',
            date: '19年8月1日',
            paragraph: [
                '大家好，我是手持三号安魂锤专治低单体暗火同时适应战神饮命两大转职攻血全属性三种潜能没准下一个神力公主皮肤就是我的序列修女绫叁。',
                '绫叁这张卡，给绝大多数人的感觉应该是脆。确实，相比于绝大多数战神来说，绫叁的身板绝对是算脆的，并且技能全部属于输出向，也仅仅是命运需要绫叁挨打才有战神这个转职的适应性。',
                '所以我们不妨先来看看饮命绫叁的优点：比大多数输出肉（废话），面对焚黛极具优势，比较适合用在无战神阵容里——众所周知，无战神且无其他受击率干扰技能的情况下对面是很容易散打的。一方面是以此来弥补饮命绫叁受击率不如战神绫叁以至于命运发动速度过慢的缺点，另一方面是通过伤害均摊来防止战神绫叁暴毙过快的尴尬。',
                '至于战神绫叁——虽然名义上是战神没错，但是实际上也是一个输出位的。战神绫叁对比起饮命绫叁来说唯一的优点就是命运发动速率大大提高，不过也相应的暴毙速度会快上不少。只不过需要注意的就是必须在多战神（个人喜好是三战神左右）的队伍里使用，不然很容易大招都开不出来就暴毙。',
                '总的来说，绫叁算是一张需要拥有扛得住爆发的环境才能使用的卡，最大的价值就是她经过命运重重buff之后对暗火敌人极具杀伤力的爆炸大招，说是一张在正确的时机使用出来会有意想不到的效果的黑科技卡也不为过。顺带一提，可能有人会发现我从头到尾都没说过绫叁在水队里怎么样……因为绫叁真的不太适合水队，水队里比她厉害的大有人在——所以我对她的定位更像是水属性单体尖兵这种感觉。',
                '推荐搭配：维兰瑟、御等牧师，皮肤苍岚、皮肤林美等战神，艾斯卡、焦藤枯土等水树体系关键卡，以及敌方的焚黛御微热夜萝烤鸭等低伤害怒气提供者。'
            ]
        },
    ]
};

export default theData