import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: '韩霏霏',
    id: 60,
    attr: {
        key: 'water',
        value: '水'
    },
    job: '战士',
    transfer: ['战神', '饮命者'],
    camp: '圣地',
    avatar: '/assets/avatar/water/韩霏霏.png',
    card: [{
        type: '20血量战神韩霏霏',
        src: '/assets/card/water/韩霏霏.jpg'
    }],
    skill: [{
        skinName: '韩霏霏',
        leader: '所有水属性队员伤害增加41%，韩菲菲的防御增加41%',
        talent: '使用特制的盾牌作为武器，回合开始时，队伍中每拥有一名水属性队员，自身的防御增加7%',
        utl: '韩菲菲对敌方单体造成大量水属性伤害，并为我方所有队员增加30%防御，持续2回合',
        fate: '回合开始时，若自身血量高于50%，自身受击率提高且水属性队员伤害增加15%；否则水属性队员受到伤害降低10%'
    }],
    resolves: [
        {
            auth: '菊花',
            date: '19年7月31日',
            paragraph: [
                '作为全服第一个满破韩菲菲的我，给韩菲菲的评价是生不逢时。',
                '韩菲菲作为一个t拥有非常硬朗的面板，不错的受击率。不错的团队buff。不错的减伤数值以及很高的防御属性。',
                '但是血族这个游戏看待一个卡是否强，其实不是对比自身。而是看大环境。什么是指大环境呢？统概而论是指，当前主流的卡组是什么？就当前8月份的大环境来讲，菜刀逐渐走向低迷，法师推向一个高潮。',
                '那么实际上韩菲菲在这个版本真的强么？并不是这样的。韩菲菲理想状态的面板是需要大量的水卡进行辅助，自身的大招30防御buff固然美好，但是作为一个t没有输出，没有怒气来源。甚至于没有回血。从各个角度来说都很稀缺。从进攻的角度来讲，永远是免死t，功能t，甚至于硬度t的替代品。为什么说是替代品，当然是因为造价。',
                '这是一张被颜色限制的卡，从组队的出发点来讲。固然是水越多越好，但是在纯色不太推崇的版本。甚至于大量的t都不怕菜刀的版本。想依赖单t来构建一个菜刀队伍无疑于以卵击石。',
                '但是作为防御面来说韩菲菲具有很多的有点，自身硬度很足，搭配怒气的阵容。防御的回合可以携带队员脸接三个大招不死。毫不夸张。自身的坦度配合百分比回血足以让顶配的刺射之外的队伍打出难以置信的伤害。',
                '队伍搭配的时候，我给出以下的建议',
                '进攻',
                '对方输出低，无回血，有爆破：水系菜刀，水系怒气',
                '对方输出低，中回血，有爆破：水系菜刀',
                '对方输出低，高回血，无爆破：水系菜刀',
                '对方输出高，高回血，有爆破：简直别用',
                '对方输出高，无回血，有爆破，有群伤：建议使用防火圈',
                '防火圈：03，导师，青龙，瑞纳',
                '防御方面，虽说血族的防御很蠢，但是我还是推荐一些，如月亮达利园列兵韩菲菲+任意苟队员；达利园伊娜韩菲菲+辅t+苟队员；辣条+导师+韩菲菲',
                '当然上述说的都是很低级的防御形式，因为这个卡的上限略低。',
                '低的主要原因还是水卡过于低迷，大家可以期待后续的水卡给水系带来的变化。',
                '或许会有翻身的一天也说不定'
            ]
        },
    ]
};

export default theData