import {EachData} from '../../../app/modal/dataModal'

const theData: EachData = {
    name: 'KK',
    id: 33,
    attr: {
        key: 'fire',
        value: '火'
    },
    job: '刺客',
    transfer: ['鬼剑', '影舞者'],
    camp: '圣地',
    avatar: '/assets/avatar/fire/kk.png',
    card: [{
        type: '20攻击鬼剑士kk',
        src: '/assets/card/fire/kk.jpg'
    }],
    skill: [{
        skinName: 'K·K',
        leader: '火属性与刺客队员攻击和暴击率增加15%（效果可叠加）',
        talent: '攻击前排的目标时，自身的伤害与暴击伤害增加30%',
        utl: 'K·K对敌方单体造成超大量火属性伤害',
        fate: '攻击时无视目标的防御'
    }],
    resolves: [
        {
            auth: '莫奈',
            date: '19年7月12日',
            paragraph: [
                'K.K——18年技能最为简明扼要的大师卡',
                '说来惭愧，我曾经对K.K这张卡有所偏见，简明粗暴的技能让人感觉乏善可陈，不过仔细看看的话，K.K这张卡还是有意思的。',
                '面板而言，K.K作为为数不多的双持武器的大师卡，有着傲人的攻击面板。必杀技中规中矩，是本系超大量的单体伤害。作为高暴击率的刺客，单体必杀假如暴击的话会造成可观的伤害。',
                '天赋技能结合出卡的环境背景来看相当的有意思。因为在K.K刚登录的时候，射手还是一线进攻队。大部分人会因为畏惧射手武器的距离追加伤害的效果，还有类似林美之类的前排减伤效果，毫不犹豫的会把T放置在前排，而这个时候K.K对其可以造成势如破竹般的伤害，简单明了。虽然现在T的前后无关紧要了一些，不过要是K.K击中前排目标，也很有可能造成致命性的伤害。',
                '命运技能也是很简明：无视防御造成伤害。这对于一些传统的靠高防御面板自居的T是相当糟糕的威胁，比如说天使，尤其是林美。在pve的时候对那些高防御的boss来说也是个优秀的对策（还是林美）。',
                'K.K的队长技，直接让火系获得了菜刀的可能。其他的火刺客，比如说火姬神，弟弟这种的吃亏在面板和固有暴击率的火刺一个新的可能性。除了PVP之外，火位面的时候，己方用K.K作为队长也是很优质的选择。',
                'K.K带队的火刺不仅解决了火系没有菜刀体系的问题，更是起到了一张卡带动了一群用途有限的平民卡的价值。虽然火刺并不是特别强劲的体系，但是对于火系的新人玩家，K.K也是比较优质的兑换选择。',
                '关于组队：',
                '①火刺：小樱，夜凛，帝利亚（优先度不高），飞鸟，火德丽莎，锌镉熔融，夜萝，狐狸，06，焚等',
                '②作为普通刺客队员进入常规鲜血刺（不加以赘述）'
            ]
        }
    ]
};

export default theData